# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.

def Input_Mass(n):
    mass = []
    for i in range(0, n):
        element = int(input())
        # добавление элементов
        mass.append(element)

    return mass

n = int(input("Введите кол-во элементов первого множества: "))
mas_n = set (Input_Mass(n))

m = int(input("Введите кол-во элементов второго множества: "))
mas_m = set (Input_Mass(m))

print(sorted(mas_n.intersection(mas_m)))

